[
{"title": "نگاهی به زندگی لن ساسامن؛ هویت خالق بیت‌کوین سرانجام افشا می‌شود؟", "tags": ["مقالات بلند و اختصاصی", "ارز دیجیتال", "فناوری"], "date_time": "دوشنبه ۱۶ مهر ۱۴۰۳ - ۱۳:۳۰", "author": "پویش پورمحمد", "source": "https://www.zoomit.ir/featured-articles/427723-len-sassaman-satoshi-nakamoto-bitcoin/", "content": ["شاید بسیاری از ما به‌تازگی با نام ", " (Len Sassaman) آشنا شده باشیم، اما افرادی که از سال‌ها پیش در حوزه‌ی رمزنگاری و حریم خصوصی فعال بوده‌اند، او را به‌عنوان یکی از چهره‌های مطرح فناوری‌های پایه‌ای حوزه‌ی کریپتو می‌شناسند.", "حالا مستند شبکه‌ی HBO با موضوع شناسایی ", "، بار دیگر توجه جهان را به این استاد امنیت سایبری جلب کرده: این مستند به کارگردانی کالن هوباک و تهیه‌کنندگی آدام مک‌کی، با هدف بررسی معمای بنیان‌گذار بیت‌کوین، موضوعاتی مانند اینکه آیا ساتوشی به‌تنهایی یا با شرکای خود کار می‌کرد و تأثیر کار او بر فضای مالی جهانی را بررسی می‌کند.", "یکی از عواملی که لن ساسامن را به چهره‌ی پشت نقاب خالق بیت‌کوین پیوند می‌زند، هم‌زمان شدن مرگ خودخواسته‌ی او با ناپدید شدن ساتوشی است. در ادامه با ما همراه باشید تا زندگی، فلسفه و برخی از مهم‌ترین پروژه‌های لن ساسامن را مرور کنیم و ببینیم آیا شواهد کافی برای این ادعا که او خالق بیت‌کوین است، وجود دارد یا خیر.", "لن ساسامن ۹ آوریل ۱۹۸۰ در شهر پاتس‌تاون ایالت پنسیلوانیای آمریکا متولد شد. او در سنین کودکی و نوجوانی بیشتر وقتش را با کامپیوترها، محاسبات و کدنویسی می‌گذراند و از همان دوران هم مطالعه‌ی مقالات و کتاب‌های مربوط به حفاظت از اطلاعات شخصی را آغاز کرد. دغدغه‌ی زودهنگام او، چالش ردیابی افراد در دنیای اطرافش بود.", "لن دوران دبیرستان خود را در مدرسه‌ی هیل سپری کرد و برخی می‌گویند او در همین ایام به افسردگی مبتلا شد. اطرافیان او می‌گویند: «لن بچه‌ی خیلی عجیبی بود؛ زیرا هوش بسیار بالایی داشت.»", "متأسفانه رویکرد تهاجمی پزشکان در درمان افسردگی، تأثیرات منفی شدیدی بر ذهن لن گذاشت و باعث شد ریشه‌های بی‌اعتمادی به‌ویژه به افراد معتبر، درون او نهادینه شود.", "لن ساسامن از نوجوانی با افسردگی دست‌وپنجه نرم می‌کرد", "لن در دهه‌ی ۱۹۹۰ به جامعه‌ی رمزنگاران پیوست؛ یعنی زمانی که اینترنت تازه داشت گسترش پیدا می‌کرد و بحث‌های پیرامون حفظ حریم خصوصی و کنترل اطلاعات به‌شدت داغ بود. او در ۱۸ سالگی در گروه ضربت مهندسی اینترنت (IETF)، سازمانی که مسئولیت توسعه‌ی پایه‌های اینترنت مدرن را به‌عهده داشت، شغلی به دست آورد و در بخش پروتکل‌های TCP/IP مشغول به کار شد.", "لن ساسامن در سال ۱۹۸۹ به خلیج سانفرانسیسکو نقل‌مکان کرد و پس از آشنایی با اصول بنیادی جنبش سایفرپانک‌ها، متوجه شد که ایده‌های کاملاً همسویی با این گروه دارد. در همان اوایل، با برام کوهن، برنامه‌نویس مشهور (که بعدها بیت‌تورنت را توسعه داد) نیز ملاقات کرد و تصمیم گرفت زمان بیشتری را با او بگذراند.", "فلسفه‌ی سایفرپانک‌ها به‌طور خاص روی تعاملات بین انسان و فناوری، تأثیرات اجتماعی و سیاسی فناوری‌های نوین و مسائلی نظیر حریم خصوصی، هویت و آزادی فردی متمرکز بود. لن نیز مانند سایر فعالین این گروه باور داشت که با پیشرفت فناوری، مرزهای بین زندگی واقعی و مجازی کم‌رنگ‌تر می‌شود و این امر چالش‌هایی جدی در زمینه‌ی هویت فردی و جمعی به دنبال خواهد داشت.", "سایفرپانک‌ها اصولی مانند هویت و آزادی فردی و حفظ حریم خصوصی را در اولویت قرار می‌دهند", "سایفرپانک‌ها همچنین به‌عنوان منتقدین سرسخت نظام‌های سیاسی و اقتصادی موجود شناخته می‌شدند که سعی داشتند نقش تأثیرات منفی «نهادگرایی» بر زندگی انسان را برای همگان آشکار کنند و راهی برای مقاومت در برابر قدرت‌های نظارتی بیابند. برجسته‌ترین راهکار نوین در این زمینه، خلق هویت‌های جدید در دنیای مجازی بود.", "ساسامن خیلی زود به یکی از برجسته‌ترین صداهای این جنبش تبدیل شد. او اغلب در جلسات رمزنگاری و کنفرانس‌های بین‌المللی سخنرانی می‌کرد و ایده‌های خود را در مورد حفظ حریم خصوصی و آزادی دیجیتال به اشتراک می‌گذاشت.", "به‌نوعی می‌توان گفت که آنچه امروز به‌عنوان اصول اولیه‌ی امنیت دیجیتال و حریم خصوصی در اینترنت می‌شناسیم، ریشه در مقالات و سخنرانی‌های ساسامن و دیگر فعالینی دارد که از سال‌های ابتدایی رشد وب، نگرانی خود را از عواقب بی‌حصار بودن داده‌های کاربران ابراز کردند و در پی یافتن راه‌حلی کارآمد برای چالش‌های بالقوه‌ی پیش رو بودند.", "ساسامن در طول دورانی که در سانفرانسیسکو اقامت داشت، با اقدامات فنی و کنش‌های سیاسی، زندگی‌اش را وقف دفاع از آزادی‌های شخصی و حریم خصوصی کرد. چنانکه در ۲۱ سالگی به‌دلیل سازماندهی اعتراضات علیه نظارت‌های دولتی و همچنین زندانی‌شدن هکری به نام ", "، نامش برای اولین‌بار در تیتر رسانه‌ها ظاهر شد.", "او در ۲۲ سالگی به همراه ", "، فعال اوپن سورس معروف، استارتاپی را برای توسعه‌ی کلید عمومی رمزنگاری تأسیس کرد، اما این استارتاپ در جریان ترکیدن حباب دات‌کام منحل شد. پس از آن لن به Network Associates پیوست تا کارش را در حوزه‌ی رمزگذاری PGP که بعدها نقشی پایه‌ای در فناوری بیت‌کوین داشت، ادامه دهد.", "ساسامن در کنار فیلیپ زیمرمن، نقشی کلیدی در توسعه‌ی PGP داشت", "ساسامن در کنار ", "، خالق PGP (Pretty Good Privacy)، نقشی کلیدی در توسعه‌ی این ابزار رمزنگاری ایفا کرد. این نرم‌افزار به افراد اجازه می‌داد اطلاعات و ایمیل‌هایشان را رمزنگاری کنند تا از چشم‌های کنجکاو دولت‌ها و هکرها محفوظ بماند.", "ایده‌ی آن‌ها برای رمزنگاری مبتنی بر کلیدهای خصوصی و عمومی توسعه یافت و با خلق امضای دیجیتال رنگ دیگری به خود گرفت: کاربران قادر بودند با کلید خصوصی خود، پیام‌هایشان را با امضای دیجیتالی مهروموم کنند و بدین‌ترتیب، گیرندگان از صحت و دست‌نخوردگی پیام‌ها در حین انتقال، اطمینان حاصل می‌کردند.", "PGP قوی‌ترین ابزار رمزنگاری ایمیل‌ها بود و امکان امضای دیجیتال را فراهم می‌کرد", "در دهه‌ی ۱۹۹۰، جنگ‌های رمزنگاری بین فعالان حریم خصوصی و دولت‌ها شدت گرفت و PGP به‌عنوان یکی از سلاح‌های اصلی این تقابل‌ها شناخته می‌شد. ساسامن که عمیقاً به آزادی اطلاعات و حفاظت از داده‌های شخصی باور داشت، به زیمرمن در بهبود و گسترش این نرم‌افزار کمک کرد.", "ساتوشی هنگام معرفی بیت‌کوین گفته بود که امیدوار است بیت‌کوین بتواند در مبادلات مالی «همان چیزی باشد که رمزنگاری قوی (یعنی PGP) برای امنیت فایل‌ها بود.»", "سایر هکرها لن ساسامن را به‌عنوان فردی باهوش و خوش‌قلب به یاد می‌آورند: برخی می‌گویند او در طول یکی از جلسات سایفرپانک‌ها همه‌چیز را رها کرده بود تا سنجابی را دنبال کند.", "برخی نیز روزهایی را به‌ خاطر می‌آورند که ساسامن با ماشین اسپرت خود با سرعت در جاده‌ها رانندگی می‌کرد، درحالی‌که به شوخی یکی از کارت‌های مونوپولی با عنوان «Get Out of Jail Free» را نزد خود نگه می‌داشت تا درصورت مواجهه با پلیس، کارت را به آن‌ها نشان دهد.", "لن در Network Associates، با ", "، دومین توسعه‌دهنده‌ی پی‌جی‌پی پس از زیمرمن آشنا شد. هال با ایجاد استاندارد RFC 4880 برای تعامل متقابل یا هم‌کنش‌پذیری OpenPGP، توجه ساسامن را به خود جلب کرد و او را به صرافت پروژه‌های مشترک انداخت.", "تا سال‌های قبل، بسیاری از کارشناسان باسابقه‌ی رمزارزها هال فینی را محبوب‌ترین گزینه برای ایفای نقش ساتوشی ناکاموتو می‌دانستند. برخی نیز معتقدند او حتماً با ساتوشی رابطه‌ی بسیار نزدیکی داشته است. همین امر دوستی ساسامن و فینی را مهم‌تر جلوه می‌دهد:", "فینی بعد از ساتوشی اولین شخصی بود که در کدنویسی بیت‌کوین مشارکت  و یک نود بیت‌کوین را اجرا کرد. او همچنین اولین فردی بود که از شخص ساتوشی بیت‌کوین دریافت کرد و با ابداع سیستم «اثبات کار قابل استفاده‌ی مجدد» (Reusable Proof-of-Work System)، روند استخراج بیت‌کوین را بهینه‌تر و کم‌هزینه‌تر کرد.", "هال فینی، همکار ساسامن، اولین فردی بود که از شخص ساتوشی بیت‌کوین دریافت کرد", "به همین دلیل اگر فینی ساتوشی ناکاموتو نباشد، قطعاً تعاملات ایمیلی گسترده‌ی خود با خالق بیت‌کوین را جعل کرده و هم‌زمان با دو هویت مجزا در توسعه‌ی بیت‌کوین نقش داشته است.", "اما ساسامن که در این دوران سخت تلاش می‌کرد از شهرت فاصله بگیرد، اغلب کارهایش را در سایه‌ی فینی انجام داد. رابطه‌ی پیچیده‌ی این دو، سؤال دیگری را روی میز می‌گذارد: آیا فینی علاوه بر دوست و همکار، پوششی برای ساسامن بود؟", "لن و هال مهارت بسیار نادر و مشترکی داشتند. هر دوی آن‌ها توسعه‌دهندگان فناوری Remailer بودند که پیام‌ها را به‌صورت ناشناس ارسال می‌کرد. سازوکار این فناوری شباهت زیادی به بیت‌کوین دارد، با این تفاوت که قبل از ارز دیجیتال معرفی شده و به‌جای پول، تراکنش‌ها را توزیع می‌کند.", "ری‌میلرها نه‌تنها مولد مستقیم فناوری بیت‌کوین بودند، بلکه ریشه‌های عمیقی در تاریخچه‌ی فکری تراکنش‌های غیرمتمرکز دارند:", "«امکان تبادل پیام به‌صورت خصوصی و بدون افشای هویت واقعی افراد»، گام بلند و تأثیرگذاری در تمرکززدایی محسوب می‌شد. بدین ترتیب کاربران می‌توانستند در تراکنش‌ها شرکت کنند، اعتبارنامه‌ی خود را نشان دهند و معامله کنند بدون اینکه سیستم‌های نظارتی قادر به ردیابی حرکات آن‌ها باشند.", "ساسامن ترویج پروژه‌های اوپن سورس را از ضروریات جامعه‌ی آزاد دیجیتال می‌دانست ", "لن علاوه‌بر مسئولیتی که به‌عنوان اپراتور ری‌میلرهای پیشرفته یا Mixmaster به‌عهده گرفت، فناوری مشابهی را نیز برای حریم خصوصی Anonymizer پیاده‌سازی کرد که ابزاری برای مخفی‌سازی هویت آنلاین کاربران بود.", "از طرف دیگر لن همیشه معتقد بود پروژه‌های متن‌باز نقش مهمی در ایجاد جامعه‌ای آزادتر و امن‌تر در فضای دیجیتال ایفا می‌کنند. یکی از اقدامات مهم او در این راستا، همکاری در توسعه‌ی GnuPG، نسخه‌ی متن‌باز PGP بود که بخشی از تلاش گسترده‌اش برای رشد و رواج فرهنگ اوپن سورس محسوب می‌شد. ", "لن ساسامن پس از پایان دبیرستان مجبور شد برای کمک به خانواده‌اش کار کند و فرصتی برای تحصیل در دانشگاه نیافت. اما به لطف فعالیت‌های حرفه‌ایش در سال ۲۰۰۴ به بلژیک دعوت شد تا به‌عنوان محقق ارشد تیم امنیت کامپیوتر و رمزنگاری صنعتی (COSIC) در دانشگاه K.U. Leuven مشغول به کار شود.", "این تیم که تحت رهبری ", " یکی از مشهورترین رمزنگاران جهان هدایت می‌شد، بستری ایدئال برای پیشرفت لن به‌شمار می‌رفت.", "استاد مشاور دوره‌ی دکترای ساسامن هم کسی نبود جز ", " که امروزه به‌عنوان پدرخوانده‌ی ارزهای دیجیتال شناخته می‌شود. گرچه چاوم اساس کل جنبش سایفرپانک‌ها را پایه‌گذاری کرده بود، ولی کمتر کسی فرصت همکاری مستقیم با او را پیدا کرده است؛ اما لن از این تجربه‌ی کمیاب نهایت استفاده را برد.", "لن ساسامن در دانشگاه بلژیک با دوتن از بزرگ‌ترین اساتید رمزنگاری جهان آشنا شد", "لن در این دوره تحقیقاتش را در زمینه‌ی پروتکل‌های امنیتی و روش‌های نوین رمزنگاری به سطوح بین‌المللی گسترش داد وهمزمان به‌عنوان استاد امنیت سایبری، به تدریس مشغول شد. برخی از افرادی که در کلاس‌های او تعلیم دیدند، بعدها به چهره‌های مشهور این حوزه تبدیل شدند.", "ساسامن به‌طور مرتب در کنفرانس‌های مشهوری مانند Defcon شرکت می‌کرد و از تبادل ایده‌های خود با برترین ذهن‌های دنیای هک و رمزنگاری لذت می‌برد؛ اما به‌وضوح به دنبال کسب شهرت و افتخارات علمی نبود. به گفته‌ی اطرافیانش، لن غالباً با نگاهی منتقدانه و دقیق به مسائل امنیتی نزدیک می‌شد و دیدگاه‌های خود را به شکلی مستقیم و صریح بیان می‌کرد.", "لن ساسامن ۱۱ فوریه‌ی ۲۰۰۶ در پنجمین کنفرانس CodeCon با ", " دانشمند علوم کامپیوتر و یکی از سخنرانان حاضر در جلسه آشنا شد. آن‌ها مدتی بعد با هم ازدواج کردند و تا سال ۲۰۱۱ با همکاری یکدیگر چندین پروژه‌ی تحقیقاتی را با موفقیت به سرانجام رساندند.", "مردیت پترسون هرگونه ادعایی را مبنی بر اینکه ساسامن همان ساتوشی ناکاموتو است، رد می‌کند.", "لن تا زمان مرگش در سال ۲۰۱۱ در COSIC در بلژیک کار کرد و در این مدت بیش از ۴۵ مقاله‌ی ارزشمند نوشت و مسئولیت برگزاری بیش از ۲۰ کنفرانس را برعهده گرفت.", "محور اصلی تحقیقات او بر توسعه پروتکل‌های حریم خصوصی متمرکز بود که به‌صورت عملی و در دنیای واقعی قابل استفاده بودند. یکی از مهم‌ترین پروژه‌هایی که در این سال‌ها با همکاری برام کوهن انجام داد، Pynchon Gate نام داشت: سیستمی که امکان بازیابی اطلاعات مستعار ری‌میلرها را از طریق شبکه‌ای توزیع‌شده و بدون دخالت شخص ثالث قابل‌ اعتماد فراهم می‌کرد.", "این پروژه بی‌شباهت به فناوری بیت‌کوین نبود. لن در ادامه‌ی راه موفق شد راه‌حل‌هایی برای خطای بیزانسی که مانع بزرگی برای شبکه‌های همتابه‌همتای قبلی محسوب می‌شد، بیابد.", "تحقیقات و پروژه‌های ساسامن راهکار‌هایی برای رفع چالش‌های ارزهای غیرمتمرکز ارائه می‌داد", "در زمینه‌ی محاسبات توزیع‌شده، تحمل خطای بیزانسی به قدرت فعال‌ماندن یک شبکه حتی زمانی که گره‌ها در معرض خطر یا غیرقابل‌ اعتماد هستند، اشاره دارد. درواقع توسعه‌ی ارز دیجیتال غیرمتمرکز بدون راهکارهای لن و همچنین بلاک‌چینی که چاوم معرفی کرد، ممکن نبود.", "بین سال‌های ۲۰۰۸ تا ۲۰۱۰ و به‌موازات توسعه‌ی بیت‌کوین، ساسامن در انجمن بین‌المللی رمزنگاری مالی (Financial Cryptography) حضور یافت و در کنار رابرت هتینگا، یکی از اولین حامیان و مروجین ارزهای دیجیتال، نشست‌های ارزشمندی را برگزار کرد.", "اما سرنخ‌های متعدد نشان می‌دهد که ساتوشی در طول توسعه‌ی بیت‌کوین در دانشگاه نیز مشغول به کار بوده است، چنانکه ", " بنیان‌گذار Bitcoin Foundation نیز این ایده را تأیید می‌کند:", "از طرف دیگر مشارکت ساتوشی در کدنویسی و بخش نظرات، در طول تعطیلات تابستانی و زمستانی به‌شدت افزایش می‌یافت، درحالی‌که اواخر بهار و پاسان سال، یعنی زمانی‌ که دانشگاهیان پرمشغله‌تر بودند، حضور او نیز کمرنگ‌تر می‌شد.", "برخی نیز می‌گویند «ساختار منحصربه‌فرد بیت‌کوین» نشان می‌دهد که ساتوشی پیشینه‌ی آکادمیک دارد. برای مثال مجله‌ی نیویورکر در سال ۲۰۱۱ نوشت:", "زمانی که ", " محقق برجسته‌ی امنیتی برای اولین‌بار کد ساتوشی را بررسی کرد، می‌خواست آن را با ۹ اکسپلویت مختلف محک بزند، اما از اینکه ساتوشی قبلاً همه‌ی آن‌ها را پیش‌بینی و اصلاح کرده بود، شگفت‌زده شد.", "شواهد زیادی نشان می‌دهد که ساتوشی ناکاموتو شخصیتی دانشگاهی است", "آیا ساتوشی و کامینسکی تجربیات و تخصص مشترکی در علوم امنیت اطلاعات داشتند؟ پاسخ این سؤال بر کسی روشن نیست، اما نکته‌ی جالب این است که ساسامن و کامینسکی زمانی به‌طور اتفاقی با هم مقاله‌ای نوشته بودند که روش‌های حمله به زیرساخت‌های کلید عمومی را شرح می‌داد.", "از طرف دیگر به گفته‌ی کارشناسان مقاله‌ی سفید بیت‌کوین در قالبی آکادمیک، با چکیده، نتیجه‌گیری و سبک رفرنس‌دهی MLA منتشر شد، درحالی‌که این جزئیات را نه در سایر پست‌های سایفرپانک‌ها می‌بینیم و نه در مقاله‌ی سفید بیت‌گلد و ارزهای مشابه.", "ساتوشی ناکاموتو هم‌زمان با زندگی ساسامن در بلژیک در اروپا حضور داشت", "تحقیقات نیویورکر نشان می‌دهد که سبک نوشتاری ساتوشی ناکاموتو بیشتر به زبان انگلیسی بریتانیایی نزدیک‌تر است، اگرچه فناوری‌هایی که او توسعه داده، بیشتر جنبه‌ی آمریکایی دارند. شاید برحسب‌ تصادف، لن ساسامن نیز با وجود آمریکایی بودن، از همان واژه‌های انگلیسی بریتانیایی استفاده می‌کرد.", "۳ جولای ۲۰۱۱ خبر خودکشی لن ساسامن از طرف همسر او تأیید شد و دنیای فناوری، به‌ویژه فعالان حوزه‌ی رمزارزها را در شوک بزرگی فرو برد. برخی شایعات ادعا می‌کردند که او به دلیل فشارهای روحی و روانی ناشی از مبارزه‌ی طولانی‌مدت با سیستم‌های نظارتی به پایان راه رسیده است، اما این نظریه‌ها هرگز به‌طور قطعی تأیید نشدند.", "ساتوشی ناکوموتو دقیقاً دو ماه قبل از خودکشی ساسامن ناپدید شد", "در همان سال دان کامینسکی در جلسه‌ی Black Hat Briefings اعلام کرد پیامی دائمی و رمزنگاری‌شده‌ای به یاد ساسامن در بلاک‌چین بیت‌کوین کدگذاری شده است؛ ادای احترامی که تا ابد در شبکه‌ای غیرقابل تغییر و مانا باقی خواهد ماند، درست مانند اثر ماندگار ساسامن در دنیای فناوری.", "اما مرگ ساسامن مصادف شد با ناپدیدشدن ساتوشی ناکاموتو: تنها ۲ ماه قبل از این حادثه، ناکاموتو آخرین پیام خود را ارسال کرد:", "پس از ۱۶۹ کد کامیت و ۵۳۹ پست در بازه‌ی زمانی یک سال، ساتوشی بی‌سروصدا ناپدید شد. طبق برآوردها، او در این زمان ۱٫۱ میلیون بیت‌کوین در اختیار داشت.", "ساسامن بخش اعظمی از زندگی خود را میان سایه‌ها گذراند. اگرچه ساتوشی ناکاموتو هرگز به‌طور علنی از او نام نبرد، اما تأثیرات و ردپای اندیشه‌ها و فناوری‌های او در بسیاری از ابعاد بیت‌کوین و فناوری بلاک‌چین به چشم می‌خورد. این هم‌زمانی‌ها، همراه با شباهت‌های چشمگیر افکار و رویکردهای این دو چهره، همچنان باعث ایجاد گمانه‌زنی‌های زیادی پیرامون هویت واقعی ساتوشی ناکاموتو می‌شود.", "آیا لن ساسامن همان ساتوشی ناکاموتو بود؟ پاسخ این پرسش هنوز در هاله‌ای از ابهام قرار دارد. اما مسلماً نام ساسامن به‌عنوان یکی از معماران پنهان دنیای دیجیتال و آزادی اطلاعات، در ذهن علاقه‌مندان فناوری باقی خواهد ماند."]}
]